NIC/secondDay.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-29 Fri 21:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Day 2</title>
<meta name="author" content="GCES Linux Community" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Day 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0b1c2e">1. Introduction to pty and tty.</a></li>
<li><a href="#orgf9ffc83">2. Basic Linux Commands along with some GNU Core Utilities &amp; Flags.</a>
<ul>
<li><a href="#org8d67512">2.1. 0. whoami</a></li>
<li><a href="#orgbd18403">2.2. 1. ls - List Directory Contents:</a></li>
<li><a href="#org15af91d">2.3. 2. pwd - Print Working Directory:</a></li>
<li><a href="#org7981384">2.4. 3. cd - Change Directory:</a>
<ul>
<li><a href="#org7526080">2.4.1. Absolute vs relative Path</a></li>
</ul>
</li>
<li><a href="#org33a6608">2.5. 4. cp - Copy Files or Directories:</a></li>
<li><a href="#orgb20d472">2.6. 5. mv - Move (Rename) Files or Directories:</a></li>
<li><a href="#org6f7d1be">2.7. 6. rm - Remove Files or Directories:</a></li>
<li><a href="#org7dd8643">2.8. 7. shred - overwrite a file to hide its contents, and optionally delete it</a></li>
<li><a href="#orgf04f3d7">2.9. 7. mkdir - Create a Directory:</a></li>
<li><a href="#orgb7e315f">2.10. 8. rmdir - Remove an Empty Directory:</a></li>
<li><a href="#orgbba47c9">2.11. 9. echo - Display a Message or Output:</a></li>
<li><a href="#orgfa72f5d">2.12. 10. cat - Concatenate and Display File Content:</a></li>
<li><a href="#org09d3963">2.13. 11. man/whatis - Display Manual Pages for Commands:</a></li>
<li><a href="#orgd76771d">2.14. 12. grep - Search Text Patterns:</a></li>
<li><a href="#orgc3a985e">2.15. 13. kill - Terminate a Process:</a></li>
<li><a href="#orgcea5cf7">2.16. 14. df - Display Disk Space Usage:</a></li>
<li><a href="#org62c6fb3">2.17. 15. du - Display File and Directory Space Usage:</a></li>
<li><a href="#org370fa8d">2.18. 16. tar - Archive and Extract Files:</a></li>
<li><a href="#org748a432">2.19. 17. zip - Compress or Decompress Files:</a></li>
<li><a href="#org1292e09">2.20. 18. wc - print newline, word, and byte counts for each file</a></li>
<li><a href="#org0da09d3">2.21. 19. ln - make links between files</a></li>
<li><a href="#org6c94bd3">2.22. 20. realpath - print the resolved path</a></li>
<li><a href="#org374f265">2.23. 21. uname - print system information</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orga0b1c2e" class="outline-2">
<h2 id="orga0b1c2e"><span class="section-number-2">1.</span> Introduction to pty and tty.</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>General overview of pseudo terminals. Usage of Default gnome-terminal.</li>
<li>Terminals navigation and shortcuts.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9ffc83" class="outline-2">
<h2 id="orgf9ffc83"><span class="section-number-2">2.</span> Basic Linux Commands along with some GNU Core Utilities &amp; Flags.</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8d67512" class="outline-3">
<h3 id="org8d67512"><span class="section-number-3">2.1.</span> 0. whoami</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Example:print effective user name
</p>
</div>
</div>
<div id="outline-container-orgbd18403" class="outline-3">
<h3 id="orgbd18403"><span class="section-number-3">2.2.</span> 1. ls - List Directory Contents:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Example: ls or ls -l (to show detailed information)
</p>
</div>
</div>
<div id="outline-container-org15af91d" class="outline-3">
<h3 id="org15af91d"><span class="section-number-3">2.3.</span> 2. pwd - Print Working Directory:</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Example: pwd
</p>
</div>
</div>
<div id="outline-container-org7981384" class="outline-3">
<h3 id="org7981384"><span class="section-number-3">2.4.</span> 3. cd - Change Directory:</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Example: cd /path/to/directory
</p>
</div>
<div id="outline-container-org7526080" class="outline-4">
<h4 id="org7526080"><span class="section-number-4">2.4.1.</span> Absolute vs relative Path</h4>
<div class="outline-text-4" id="text-2-4-1">
</div>
<ol class="org-ol">
<li><a id="org112ca3c"></a>Relative Path<br />
<div class="outline-text-5" id="text-2-4-1-1">
<p>
Relative paths are specified from the current working directory.
Example: cd ../../path/to/directory
</p>
</div>
</li>
<li><a id="org5c771b7"></a>Absolute Path<br />
<div class="outline-text-5" id="text-2-4-1-2">
<p>
Absolute paths provide the full file or directory location from the root directory.
  Example: cd /home/usrname/Desktop
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org33a6608" class="outline-3">
<h3 id="org33a6608"><span class="section-number-3">2.5.</span> 4. cp - Copy Files or Directories:</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Example: cp sourcefile destination
</p>
</div>
</div>
<div id="outline-container-orgb20d472" class="outline-3">
<h3 id="orgb20d472"><span class="section-number-3">2.6.</span> 5. mv - Move (Rename) Files or Directories:</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Example: mv oldname newname or mv source destination
</p>
</div>
</div>
<div id="outline-container-org6f7d1be" class="outline-3">
<h3 id="org6f7d1be"><span class="section-number-3">2.7.</span> 6. rm - Remove Files or Directories:</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Example: rm filename or rm -r directory (be cautious with the -r option)
</p>
</div>
</div>
<div id="outline-container-org7dd8643" class="outline-3">
<h3 id="org7dd8643"><span class="section-number-3">2.8.</span> 7. shred - overwrite a file to hide its contents, and optionally delete it</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Example: shred -n 10 filename
</p>
</div>
</div>
<div id="outline-container-orgf04f3d7" class="outline-3">
<h3 id="orgf04f3d7"><span class="section-number-3">2.9.</span> 7. mkdir - Create a Directory:</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Example: mkdir -p ~/Desktop/Test/newFolder
</p>
</div>
</div>
<div id="outline-container-orgb7e315f" class="outline-3">
<h3 id="orgb7e315f"><span class="section-number-3">2.10.</span> 8. rmdir - Remove an Empty Directory:</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Example: rmdir emptydirectory
</p>
</div>
</div>
<div id="outline-container-orgbba47c9" class="outline-3">
<h3 id="orgbba47c9"><span class="section-number-3">2.11.</span> 9. echo - Display a Message or Output:</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Example: echo "Hello, World!"
</p>
</div>
</div>
<div id="outline-container-orgfa72f5d" class="outline-3">
<h3 id="orgfa72f5d"><span class="section-number-3">2.12.</span> 10. cat - Concatenate and Display File Content:</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Example: cat filename
</p>
</div>
</div>
<div id="outline-container-org09d3963" class="outline-3">
<h3 id="org09d3963"><span class="section-number-3">2.13.</span> 11. man/whatis - Display Manual Pages for Commands:</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Example: man commandName
</p>
</div>
</div>
<div id="outline-container-orgd76771d" class="outline-3">
<h3 id="orgd76771d"><span class="section-number-3">2.14.</span> 12. grep - Search Text Patterns:</h3>
<div class="outline-text-3" id="text-2-14">
<p>
Example: grep pattern filename
</p>
</div>
</div>
<div id="outline-container-orgc3a985e" class="outline-3">
<h3 id="orgc3a985e"><span class="section-number-3">2.15.</span> 13. kill - Terminate a Process:</h3>
<div class="outline-text-3" id="text-2-15">
<p>
Example: kill processId
</p>
</div>
</div>
<div id="outline-container-orgcea5cf7" class="outline-3">
<h3 id="orgcea5cf7"><span class="section-number-3">2.16.</span> 14. df - Display Disk Space Usage:</h3>
<div class="outline-text-3" id="text-2-16">
<p>
Example: df -h (to show human-readable sizes)
</p>
</div>
</div>
<div id="outline-container-org62c6fb3" class="outline-3">
<h3 id="org62c6fb3"><span class="section-number-3">2.17.</span> 15. du - Display File and Directory Space Usage:</h3>
<div class="outline-text-3" id="text-2-17">
<p>
Example: du -h (to show human-readable sizes)
</p>
</div>
</div>
<div id="outline-container-org370fa8d" class="outline-3">
<h3 id="org370fa8d"><span class="section-number-3">2.18.</span> 16. tar - Archive and Extract Files:</h3>
<div class="outline-text-3" id="text-2-18">
<p>
Example: tar -cvf archive.tar file1 file2 file3
Example: tar -xvf archive.tar &#x2013;one-top-level
</p>
</div>
</div>
<div id="outline-container-org748a432" class="outline-3">
<h3 id="org748a432"><span class="section-number-3">2.19.</span> 17. zip - Compress or Decompress Files:</h3>
<div class="outline-text-3" id="text-2-19">
<p>
Example: gzip filename (compress) or gzip -d filename.gz (decompress)
</p>
</div>
</div>
<div id="outline-container-org1292e09" class="outline-3">
<h3 id="org1292e09"><span class="section-number-3">2.20.</span> 18. wc - print newline, word, and byte counts for each file</h3>
<div class="outline-text-3" id="text-2-20">
<p>
Example: wc filename
</p>
</div>
</div>
<div id="outline-container-org0da09d3" class="outline-3">
<h3 id="org0da09d3"><span class="section-number-3">2.21.</span> 19. ln - make links between files</h3>
<div class="outline-text-3" id="text-2-21">
<p>
Example: ln -s file1 sLink
</p>
</div>
</div>
<div id="outline-container-org6c94bd3" class="outline-3">
<h3 id="org6c94bd3"><span class="section-number-3">2.22.</span> 20. realpath - print the resolved path</h3>
<div class="outline-text-3" id="text-2-22">
<p>
Example:realpath filename &#x2013;relative-to=[DIR]
</p>
</div>
</div>
<div id="outline-container-org374f265" class="outline-3">
<h3 id="org374f265"><span class="section-number-3">2.23.</span> 21. uname - print system information</h3>
<div class="outline-text-3" id="text-2-23">
<p>
Example: uname -a
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-29 Fri</p>
<p class="author">Author: GCES Linux Community</p>
<p class="date">Created: 2023-12-29 Fri 21:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>